export default [
	{
		"title": "打包体积的分析和优化"
	},
	{
		"title": "原型和原型链"
	},
	{
		"title": "0.1+0.2≠0.3? 请解释原理"
	},
	{
		"title": "大文件『切片上传』如何实现 ？"
	},
	{
		"title": "继承方式有哪些【原型链继承、构造函数继承、组合继承、寄生组合继承】"
	},
	{
		"title": "constructor内部和外部定义方法有什么区别？"
	},
	{
		"title": "parseInt( )执行结果是多少？"
	},
	{
		"title": "JS中的类型转换规则"
	},
	{
		"title": "什么是变量提升"
	},
	{
		"title": "var、let、const有什么区别？"
	},
	{
		"title": "什么是 BFC ？"
	},
	{
		"title": "Number.isNaN 与 isNaN的区别是什么？"
	},
	{
		"title": "如何使用 Proxy 实现链式调用？"
	},
	{
		"title": "如何实现数组的扁平化？"
	},
	{
		"title": "Object 和 Map 的区别是什么？"
	},
	{
		"title": "隐式类型转换的结果是多少？"
	},
	{
		"title": "静态方法与实例方法"
	},
	{
		"title": "前端面试：如何删除数组中所有的元素？"
	},
	{
		"title": "前端面试：这段代码的最终执行结构是多少？"
	},
	{
		"title": "bind、apply、call的区别和应用场景"
	},
	{
		"title": "前端面试：什么是柯里化？如何实现柯里化？"
	},
	{
		"title": "前端面试：if 内的打印结果是多少？"
	},
	{
		"title": "前端面试：取整的时候你会用 parseInt 还是 Math.floor ?"
	},
	{
		"title": "前端面试：对象解构的高级用法了解多少？"
	},
	{
		"title": "前端面试：什么是变量屏蔽？"
	},
	{
		"title": "JavaScript解构的原理是什么"
	},
	{
		"title": "前端面试：一道题考察你对 this 指向的理解"
	},
	{
		"title": "前端面试：var 和 let 的区别有哪些？"
	},
	{
		"title": "前端面试：为什么要使用 void 0 代替 undefined ？"
	},
	{
		"title": "前端面试：数组的索引可以是对象、函数、Symbol吗？"
	},
	{
		"title": "前端面试：不使用临时变量，如何交换 x 和 y的值？"
	},
	{
		"title": "前端面试：Math.floor 和 parseInt 有什么区别？"
	},
	{
		"title": "前端面试：绑定 this 的方法有哪些？它们之间有什么相同点和不同点？"
	},
	{
		"title": "前端面试：自增运算的执行结果是多少？"
	},
	{
		"title": "前端面试：if 内打印的结果是多少？考察隐式类型转换的掌握"
	},
	{
		"title": "前端面试：如何函数的length属性表示什么？这段代码的输出结果是多少？"
	},
	{
		"title": "前端面试：如何实现属性的私有化？你有哪些方案？各自的优缺点是什么？"
	},
	{
		"title": "前端面试：什么是纯函数？JavaScript 有哪些自带的纯函数？"
	},
	{
		"title": "前端面试：了解变量提升吗？foo函数中三个 a 的输出结果分别是多少？"
	},
	{
		"title": "前端面试手写题：实现数组扁平化"
	},
	{
		"title": "前端面试：什么是柯里化？如何将一个函数柯里化？"
	},
	{
		"title": "前端面试：实现动态执行有哪几种方式？"
	},
	{
		"title": "前端面试：点操作符和方括号访问对象的属性有什么区别？哪个是动态属性，哪个是静态属性？"
	},
	{
		"title": "前端面试：var、let、const 的区别你能回答出几条呢？"
	},
	{
		"title": "前端面试：['1','2','3'].map(parseInt)的输出结果是多少？你真的了解 parseInt 吗？"
	},
	{
		"title": "前端面试：了解对象的解构吗？address 和 addr 值分别是多少？请解释整个解构过程"
	},
	{
		"title": "前端面试：这个立即执行函数的输出结果是多少？请解释其原理。"
	},
	{
		"title": "前端面试：Object.is()、严格相等、非严格相等之间的区别是什么？"
	},
	{
		"title": "前端面试：该代码中数组的解构是否会报错？请解释原因。"
	},
	{
		"title": "前端面试：this 的绑定规则了解吗？请说出这段代码的输出结果？"
	},
	{
		"title": "前端面试：如何区分构造函数和普通函数？了解 new.target 的作用吗？"
	},
	{
		"title": "前端面试：数组的解构有哪些高级用法呢？如何嵌套解构？"
	},
	{
		"title": "前端面试：var 和 let 之间有哪些区别？在面试中你能回答出几条呢？"
	},
	{
		"title": "前端面试：void 0 和 undefined 有区别吗？日常开发中选择哪个？为什么？"
	},
	{
		"title": "前端面试：构造函数内的属性、方法与构造函数外的有什么区别？可以混用吗？"
	},
	{
		"title": "前端面试：请说出这段代码的执行结果。数字和字符串当做数组的索引有什么区别？"
	},
	{
		"title": "前端面试：交换 x 和 y 的值有哪些方法？不使用额外空间能否交换？"
	},
	{
		"title": "前端面试：Math.floor 和 parseInt 有什么区别？分别在哪些场景下使用？"
	},
	{
		"title": "前端面试：为什么在 setTimeout 里的执行结果和全局作用域下的执行结果不同？"
	},
	{
		"title": "前端面试：了解自增运算符吗？请说出这两段代码的输出结果。"
	},
	{
		"title": "前端面试：了解隐式类型转换吗？这段代码的输出结果是多少呢？"
	},
	{
		"title": "前端面试：函数的 length 表示什么？这段代码的输出结果是什么？"
	},
	{
		"title": "前端面试：如何设置私有属性？你有几种方式实现私有属性？"
	},
	{
		"title": "前端面试：什么是纯函数？你在实际项目中使用过哪些纯函数？"
	},
	{
		"title": "前端面试：了解变量提升吗？请说出这段代码输出结果。"
	},
	{
		"title": "前端面试手写题：实现数组扁平化 flat() 方法"
	},
	{
		"title": "前端面试：什么是柯里化？请实现一个柯里化函数"
	},
	{
		"title": "前端面试：什么是动态执行？有哪些实现动态执行的方式？"
	},
	{
		"title": "前端面试：什么是动态属性？什么是静态属性？它们之间有什么区别？"
	},
	{
		"title": "前端面试基础：var、let、const有哪些区别？你能回答哪些？"
	},
	{
		"title": "前端面试：练习一道常考的易错题  [\"1\",\"2\",\"3\"].map(parseInt) 的结果是多少？"
	},
	{
		"title": "前端面试：了解对象的解构吗？address 和 addr 的值分别是多少？"
	},
	{
		"title": "前端面试：什么是短路规则？ && 和 || 的运算规则是什么？"
	},
	{
		"title": "前端面试：连续赋值的结果是什么？console.log 输出的内容？"
	},
	{
		"title": "前端面试：什么是作用域链？这个立即执行函数的输出是多少？"
	},
	{
		"title": "前端面试：Object.is() 和 === 可以混用吗？有什么区别？"
	},
	{
		"title": "前端面试：考察 this 绑定规则，请说出执行结果"
	},
	{
		"title": "前端面试：解构的原理是什么？如何修改这段代码使其正确执行？"
	},
	{
		"title": "前端面试：如何区分普通函数和构造函数？"
	},
	{
		"title": "前端面试：你对 Prototype 原型了解多少？请说出 say（）的执行结果。"
	},
	{
		"title": "前端面试基础：数组的解构了解多少？有哪些高级用法？"
	},
	{
		"title": "前端面试基础：var 和 let 的区别有哪些? 你能否回答完整？"
	},
	{
		"title": "前端面试: void 0 和 undefined 有什么区别？它们之间可以互换吗？"
	},
	{
		"title": "前端面试：构造函数的内外定义的属性、方法有哪些区别呢？"
	},
	{
		"title": "前端面试：什么是组合函数？如何实现组合函数？"
	},
	{
		"title": "前端面试：v-model 如何实现父子组件通信？"
	},
	{
		"title": "前端面试：v-model 如何给子组件传多个参数？"
	},
	{
		"title": "前端面试手写题：如何使用 Proxy 实现链式调用"
	},
	{
		"title": "前端面试：watch 和 watchEffect 有什么区别？watch可以代替 watchEffect 吗？"
	},
	{
		"title": "前端面试：什么是管道运算符？如何手写实现管道函数？"
	},
	{
		"title": "前端面试：数组的索引可以是哪些类型？是否会进行隐式类型转换？请说出代码的输出结果。"
	},
	{
		"title": "前端面试：watch 有哪些配置项 ？如何控制 watch 回调函数触发时机？"
	},
	{
		"title": "前端面试：不使用临时变量，如何交换 x 和 y 的值？"
	},
	{
		"title": "前端面试易错题：NaN 表示什么意思？如何判断 NaN 的值？"
	},
	{
		"title": "前端面试手写题：如何实现 flat 函数？将多维数组转化为一维数组"
	},
	{
		"title": "前端面试：keyof的作用是什么？如何使用 keyof 安全获取对象的属性？"
	},
	{
		"title": "前端面试：Object 和 Map 有什么相同点和不同点？什么场景下需要用 Map？"
	},
	{
		"title": "前端面试：parseInt 和 Math.floor 能否混用？什么场景下只能使用 Math.floor?"
	},
	{
		"title": "前端面试基础：bind、apply、call绑定 this 的时候，有哪些不同点？你能否回答完整？"
	},
	{
		"title": "前端面试：自增运算符的易错题。这2段代码的输出结果是什么？"
	},
	{
		"title": "前端面试：箭头函数的 this 指向如何判断？fun1 和 fun2 的输出结果分别是什么？"
	},
	{
		"title": "前端面试：什么是隐式类型转换？这段代码的输出结果是多少？"
	},
	{
		"title": "前端面试基础：什么是私有属性？有哪些方式能够实现私有属性？"
	},
	{
		"title": "前端面试基础：什么是纯函数？JavaScript 中有哪些纯函数？"
	},
	{
		"title": "02:42 前端面试：箭头函数的 this 在运行时绑定？还是在定义时绑定？如何判断它的 this 绑定时机？"
	},
	{
		"title": "前端面试：什么是剩余参数？这段代码为什么会报错？应该如何修改？"
	},
	{
		"title": "前端面试：如何判断函数的 length 属性？这段代码的输出结果是多少？"
	},
	{
		"title": "前端面试手写题：如何计算所有属性的和？使用属性描述符的优势是什么？"
	},
	{
		"title": "前端面试手写题：什么是柯里化？如何实现一个柯里化函数？"
	},
	{
		"title": "前端面试易错点：如何判断回调函数中 this 的指向？这段代码最终输出多少？"
	},
	{
		"title": "前端面试基础：对作用域链和立即执行函数了解多少？这段函数的输出结果是什么？"
	},
	{
		"title": "前端面试：什么是变量提升？根据变量提升的规则，写出代码执行结果。"
	},
	{
		"title": "前端面试：如何访问对象的属性？点符号访问和方括号访问的区别是什么？"
	},
	{
		"title": "前端面试基础：var、let、const之间有哪些区别？你能否回答完整？"
	},
	{
		"title": "前端手写题：如何实现索引的累加？考察对 Proxy 对象的理解。"
	},
	{
		"title": "前端面试：连续赋值的计算规则是什么？这段代码的输出结果是什么？"
	},
	{
		"title": "前端面试：Object.is 和 === 有哪些区别？它们各自的判断规则是什么？"
	},
	{
		"title": "前端面试：[\"1\",\"2\",\"3“].map(parseInt) 的输出结果是多少？parseInt 的第二个参数作用是什么？"
	},
	{
		"title": "前端面试：forEach 函数的原理是什么？为什么这段代码不会陷入无限循环？"
	},
	{
		"title": "前端面试：什么是惰性函数？在什么场景下会使用惰性函数？"
	},
	{
		"title": "前端面试：如何判断函数的 this？请说出这2个函数的执行结果。"
	},
	{
		"title": "前端面试：解构的原理是什么？这段代码为什么报错？"
	}
]